# Usage:
#  $ brew bundle --global
#  $ brew bundle --global cleanup --force

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Dumped from iMac in May 2020.
# TODO: Organize and remove stuff no longer needed.
brew "ack"
brew "libyaml"
brew "ansible"
brew "autoconf"
brew "autojump"
brew "awscli"
brew "bash"
brew "boost"
brew "forego"
brew "git"
brew "go", args: ["cross-compile-common"]
brew "glide"
brew "oniguruma"
brew "jq"
brew "libassuan"
brew "libusb"
brew "libgcrypt"
brew "libksba"
brew "mercurial"
brew "minicom"
brew "mysql"
brew "open-ocd"
brew "optipng"
brew "packer"
brew "pandoc"
brew "picocom"
brew "postgresql"
brew "pstree"
brew "pth"
brew "pwgen"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "redis"
brew "terraform"
brew "terraform-inventory"
brew "tidy-html5"
brew "tmux"
brew "tup"
brew "wget"
cask "qlstephen"

# https://github.com/keith/reminders-cli
tap "keith/formulae"
brew "keith/formulae/reminders-cli"

# To build stuff for ARM boards (incl. ODrive)
tap "osx-cross/arm"
brew "osx-cross/arm/arm-gcc-bin"

# Added after May 2020
cask "1password-cli"
brew "shellcheck"
brew "youtube-dl"
